const { SlashCommandBuilder, EmbedBuilder } = require('discord.js');

const { User } = require(`../../../src/schemas/userdata`);
const chalk = require(`chalk`);
const linksInfo = require(`../../../src/discord structure/links.json`)

async function autoComplete(interaction, client) {
    const focusedValue = interaction.options.getFocused();
    const choices = [
        'cake',
        'like',
        'ban',
        'heart',
        'miracle',
        'snowman',
        'sova',
        'ghost',
        'santa',
        'dragon',
        'egg',
        'palm'
    ];
    const filtered = choices.filter(choice => choice.toLowerCase().includes(focusedValue.toLowerCase()));;
    await interaction.respond(
        filtered.map(choice => ({ name: choice, value: choice })),
    );
}

/**
 * 
 * @param {import("discord.js").ChatInputCommandInteraction} interaction Interaction
 * @param {import("../../../src/misc_functions/Exporter").StarpixelClient} client Client
 * 
 * Interaction main function
 */
async function execute(interaction, client) {
    try {

        switch (interaction.options.getString(`картинка`)) {
            case `cake`: {
                const role = `850079153746346044`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`░░░░░░░░░░░░░▄▄░░░░░░░░░░░
░░░░░░░░░░░░▄██▄░░░░░░░░░░
░░░░░░░░░░░██▀░██░░░░░░░░░
░░░░░░░░░░░██░░█▀░░░░░░░░░
░░░░░░░░░░░░▀░░░░░░░░░░░░░
░░░░░░░░░░░▄▄▄▄▄▄█░░░░░░░░
░░░░░░░░▄████████▀░░░░░░░░
░░░░░░░░█████████░░░░░░░░░
░░░░░░░░░████████░░░░░░░░░
░░░░░░░░░████████░░░░░░░░░
░░░░░░░░░████████░░░░░░░░░
░░▄▄▄█████████████████▄▄░░
░████████████████████████▄
░░░▀███▀░░▀█████▀░░▀████▀░
▀▄▄░░▀░░▄▄▄░███░▄▄▄░░░░░░▄
░███▄▄▄████▄░▀░▄████▄▄▄▄█▀
░▀███████████▄███████████░
░░▀█████████████████████▀░
░░░█████████████████████░░
░░░█████████████████████░░\`
Тортик от ${interaction.member}`)
                    } else {
                        interaction.reply(
                            `\`░░░░░░░░░░░░░▄▄░░░░░░░░░░░
░░░░░░░░░░░░▄██▄░░░░░░░░░░
░░░░░░░░░░░██▀░██░░░░░░░░░
░░░░░░░░░░░██░░█▀░░░░░░░░░
░░░░░░░░░░░░▀░░░░░░░░░░░░░
░░░░░░░░░░░▄▄▄▄▄▄█░░░░░░░░
░░░░░░░░▄████████▀░░░░░░░░
░░░░░░░░█████████░░░░░░░░░
░░░░░░░░░████████░░░░░░░░░
░░░░░░░░░████████░░░░░░░░░
░░░░░░░░░████████░░░░░░░░░
░░▄▄▄█████████████████▄▄░░
░████████████████████████▄
░░░▀███▀░░▀█████▀░░▀████▀░
▀▄▄░░▀░░▄▄▄░███░▄▄▄░░░░░░▄
░███▄▄▄████▄░▀░▄████▄▄▄▄█▀
░▀███████████▄███████████░
░░▀█████████████████████▀░
░░░█████████████████████░░
░░░█████████████████████░░\`
Тортик от ${interaction.member} для ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;
            case `like`: {
                const role = `850079142413598720`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`___¶¶¶¶¶___¶¶¶¶¶________¶¶¶¶¶___¶¶¶¶¶__
__¶¶¶¶¶¶¶_¶¶¶¶¶¶¶______¶¶¶¶¶¶¶_¶¶¶¶¶¶¶_
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_
____¶¶¶¶¶¶¶¶¶¶¶__________¶¶¶¶¶¶¶¶¶¶¶___
_______¶¶¶¶¶________________¶¶¶¶¶______
_______________________________________
_______________________________________
_______________________________________
__¶¶¶¶¶¶¶_____________________¶¶¶¶¶¶¶__
___¶¶¶¶¶¶¶¶¶¶_____________¶¶¶¶¶¶¶¶¶¶___
______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____
___________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶_____
___________________¶¶¶___¶¶____¶¶¶
___________________¶¶¶___¶¶____¶¶¶
____________________¶¶¶_______¶¶¶
_____________________¶¶¶¶¶¶¶¶¶¶\`
                        
${interaction.member} что-то приглядел...`)
                    } else {
                        interaction.reply(
                            `\`___¶¶¶¶¶___¶¶¶¶¶________¶¶¶¶¶___¶¶¶¶¶__
__¶¶¶¶¶¶¶_¶¶¶¶¶¶¶______¶¶¶¶¶¶¶_¶¶¶¶¶¶¶_
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_
____¶¶¶¶¶¶¶¶¶¶¶__________¶¶¶¶¶¶¶¶¶¶¶___
_______¶¶¶¶¶________________¶¶¶¶¶______
_______________________________________
_______________________________________
_______________________________________
__¶¶¶¶¶¶¶_____________________¶¶¶¶¶¶¶__
___¶¶¶¶¶¶¶¶¶¶_____________¶¶¶¶¶¶¶¶¶¶___
______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____
___________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶_____
___________________¶¶¶___¶¶____¶¶¶
___________________¶¶¶___¶¶____¶¶¶
____________________¶¶¶_______¶¶¶
_____________________¶¶¶¶¶¶¶¶¶¶\`
                        
${interaction.member} приглядел ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `heart`: {
                const role = `642810535737425930`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`_░▒███████
░██▓▒░░▒▓██
██▓▒░__░▒▓██___██████
██▓▒░____░▓███▓__░▒▓██
██▓▒░___░▓██▓_____░▒▓██
██▓▒░_______________░▒▓██
_██▓▒░______________░▒▓██
__██▓▒░____________░▒▓██
___██▓▒░__________░▒▓██
____██▓▒░________░▒▓██
_____██▓▒░_____░▒▓██
______██▓▒░__░▒▓██
_______█▓▒░░▒▓██
_________░▒▓██
_______░▒▓██
_____░▒▓██\`

Сердечко от ${interaction.member}`)
                    } else {
                        interaction.reply(
                            `\`_░▒███████
░██▓▒░░▒▓██
██▓▒░__░▒▓██___██████
██▓▒░____░▓███▓__░▒▓██
██▓▒░___░▓██▓_____░▒▓██
██▓▒░_______________░▒▓██
_██▓▒░______________░▒▓██
__██▓▒░____________░▒▓██
___██▓▒░__________░▒▓██
____██▓▒░________░▒▓██
_____██▓▒░_____░▒▓██
______██▓▒░__░▒▓██
_______█▓▒░░▒▓██
_________░▒▓██
_______░▒▓██
_____░▒▓██\`

Сердечко от ${interaction.member} для ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `miracle`: {
                const role = `642810538518118430`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`░░░░░░░░░░░░░░░░░░░░░░░░░░█▄
░▄▄▄▄▄▄░░░░░░░░░░░░░▄▄▄▄▄░░█▄
░▀▀▀▀▀███▄░░░░░░░▄███▀▀▀▀░░░█▄
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░▄▀▀▀▀▀▄░░░░░░░░░░▄▀▀▀▀▀▄░░░░█
█▄████▄░▀▄░░░░░░▄█░▄████▄▀▄░░█▄
████▀▀██░▀▄░░░░▄▀▄██▀█▄▄█░█▄░░█
██▀██████░█░░░░█░████▀█▀██░█░░█
████▀▄▀█▀░█░░░░█░█████▄██▀▄▀░░█
███████▀░█░░░░░░█░█████▀░▄▀░░░█
░▀▄▄▄▄▄▀▀░░░░░░░░▀▀▄▄▄▄▀▀░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░░▓▓▓▓▓▓▓░░░░░░░░░░▓▓▓▓▓▓▓░░░░█
░░░▓▓▓▓▓░░░░░░░░░░░░▓▓▓▓▓░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█▀
░░░░░░░░░▄▄███████▄▄░░░░░░░░░█
░░░░░░░░█████████████░░░░░░░█▀
░░░░░░░░░▀█████████▀░░░░░░░█▀
░░░░░░░░░░░░░░░░░░░░░░░░░░█▀
░░░░░░░░░░░░░░░░░░░░░░░░░█▀\`
${interaction.member} видит чудо...`)
                    } else {
                        interaction.reply(
                            `\`░░░░░░░░░░░░░░░░░░░░░░░░░░█▄
░▄▄▄▄▄▄░░░░░░░░░░░░░▄▄▄▄▄░░█▄
░▀▀▀▀▀███▄░░░░░░░▄███▀▀▀▀░░░█▄
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░▄▀▀▀▀▀▄░░░░░░░░░░▄▀▀▀▀▀▄░░░░█
█▄████▄░▀▄░░░░░░▄█░▄████▄▀▄░░█▄
████▀▀██░▀▄░░░░▄▀▄██▀█▄▄█░█▄░░█
██▀██████░█░░░░█░████▀█▀██░█░░█
████▀▄▀█▀░█░░░░█░█████▄██▀▄▀░░█
███████▀░█░░░░░░█░█████▀░▄▀░░░█
░▀▄▄▄▄▄▀▀░░░░░░░░▀▀▄▄▄▄▀▀░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░░▓▓▓▓▓▓▓░░░░░░░░░░▓▓▓▓▓▓▓░░░░█
░░░▓▓▓▓▓░░░░░░░░░░░░▓▓▓▓▓░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█▀
░░░░░░░░░▄▄███████▄▄░░░░░░░░░█
░░░░░░░░█████████████░░░░░░░█▀
░░░░░░░░░▀█████████▀░░░░░░░█▀
░░░░░░░░░░░░░░░░░░░░░░░░░░█▀
░░░░░░░░░░░░░░░░░░░░░░░░░█▀\`
${interaction.member} видит чудо... и это ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `snowman`: {
                const role = `642819600429481997`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`________________§§§§§§§§§
_______________§§§§§§§§§§§
______________§§§§§§____§§§
_____________§§§§§§§§____§§
____________§§§§§§§§§§____§§§§
___________§§§§§§§§§§§§___§cd§§
_________§§§§§§§§§§§§§§§§__§§§
________§§§§§§§§§§§§§§§§§§_______§_§_§_§_§
_______§§§§§§§§§§§§§§§§§§§§______§_§_§_§_§
______§§§________________§§§_____§_§_§_§_§
______§§__§§_______§§_____§§_____§§§§§§§§
______§§______§§__________§§______§§cd§§
______§§___§______§_______§§_______§§§§
_______§§___§§§§§§_______§§_________§§
________§§______________§§__________§§
_________§§§§§§§§§§§§§§§§___________§§
______§§§§§§§§§§§§§§§§§§§§§§__§§§§§§§§
_§§§§§§§§§§_______________§§§§___§§§§§
§§§§§§_§§§________________§§__§§§___§§
____§__§§_________________§§§§§§____§§
__§§___§§__________________§§_______§§
___§§__§§__________________§§_______§§
_____§§§§§_________________§§_______§§
_________§§_______________§§________§§
__________§§_____________§§_________§§
____________§§§§§§§§§§§§§§__________§§\`

${interaction.member} слепил снеговика.`)
                    } else {
                        interaction.reply(
                            `\`________________§§§§§§§§§
_______________§§§§§§§§§§§
______________§§§§§§____§§§
_____________§§§§§§§§____§§
____________§§§§§§§§§§____§§§§
___________§§§§§§§§§§§§___§cd§§
_________§§§§§§§§§§§§§§§§__§§§
________§§§§§§§§§§§§§§§§§§_______§_§_§_§_§
_______§§§§§§§§§§§§§§§§§§§§______§_§_§_§_§
______§§§________________§§§_____§_§_§_§_§
______§§__§§_______§§_____§§_____§§§§§§§§
______§§______§§__________§§______§§cd§§
______§§___§______§_______§§_______§§§§
_______§§___§§§§§§_______§§_________§§
________§§______________§§__________§§
_________§§§§§§§§§§§§§§§§___________§§
______§§§§§§§§§§§§§§§§§§§§§§__§§§§§§§§
_§§§§§§§§§§_______________§§§§___§§§§§
§§§§§§_§§§________________§§__§§§___§§
____§__§§_________________§§§§§§____§§
__§§___§§__________________§§_______§§
___§§__§§__________________§§_______§§
_____§§§§§_________________§§_______§§
_________§§_______________§§________§§
__________§§_____________§§_________§§
____________§§§§§§§§§§§§§§__________§§\`

${interaction.member} слепил снеговика для ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `sova`: {
                const role = `850079134700666890`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`____________*_____*
___________*_*****_*
__________*_(O)_(O)_*
_________**____V____**
_________**_________**
_________**_________**
__________*_________*
___________***___***\`
Сова ${interaction.member}`)
                    } else {
                        interaction.reply(
                            `\`____________*_____*
___________*_*****_*
__________*_(O)_(O)_*
_________**____V____**
_________**_________**
_________**_________**
__________*_________*
___________***___***\`
Сова от ${interaction.member} для ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `ghost`: {
                const role = `893927886766096384`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ 
▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒ 
▒▒█▒▒▒▄██████████▄▒▒▒▒ 
▒█▐▒▒▒████████████▒▒▒▒ 
▒▌▐▒▒██▄▀██████▀▄██▒▒▒ 
▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒ 
▐┼▐▒▒██████████████▒▒▒ 
▐▄▐████─▀▐▐▀█─█─▌▐██▄▒ 
▒▒█████──────────▐███▌ 
▒▒█▀▀██▄█─▄───▐─▄███▀▒ 
▒▒█▒▒███████▄██████▒▒▒ 
▒▒▒▒▒██████████████▒▒▒ 
▒▒▒▒▒██████████████▒▒▒ 
▒▒▒▒▒█████████▐▌██▌▒▒▒ 
▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒ 
▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒ 
▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒

${interaction.member} пугает всех`)
                    } else {
                        interaction.reply(
                            `▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ 
▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒ 
▒▒█▒▒▒▄██████████▄▒▒▒▒ 
▒█▐▒▒▒████████████▒▒▒▒ 
▒▌▐▒▒██▄▀██████▀▄██▒▒▒ 
▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒ 
▐┼▐▒▒██████████████▒▒▒ 
▐▄▐████─▀▐▐▀█─█─▌▐██▄▒ 
▒▒█████──────────▐███▌ 
▒▒█▀▀██▄█─▄───▐─▄███▀▒ 
▒▒█▒▒███████▄██████▒▒▒ 
▒▒▒▒▒██████████████▒▒▒ 
▒▒▒▒▒██████████████▒▒▒ 
▒▒▒▒▒█████████▐▌██▌▒▒▒ 
▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒ 
▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒ 
▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒

${interaction.member} пугает ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `dragon`: {
                const role = `694914077104799764`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`░██════════▒██
███═════════░███▒
███░══════════░███
███▓═════█══════███▒
████▒═══░██══════███▓════█
█████▒════███═════███▓═══▒██
██████▒════▓██▒═══░███▒═══▒██
████████░═══▓███═══████════▒██
█████████▓░══████══▒███▒════███
████████████▒█████══████░═══▓███
██████████████████▒═█████═══████▒
███████████████████═▒████▓══████▒
█████████████▓█████══█████▒═████░
█████████████▒═█████═▓██████████░
░═░░▒▓███████▒══░███░═██████████░
═══░════▒▓████═█░═▒██═██████████▒
███████▓▒░▒███═▒█▓░═══███████████
═░▒▓████████▓██═████▓▓███████████░
══════▒████▓███▒═█████████████████
════════▒███████░═▒███████████████░
══════════███████▓═▒█████████▓████▒
═══════════▓██████▓░█████████═▓███
════════════████████████████══███▓
═════════════██████████████▒═▒███
═══════░░░░░▒██████████████▒═████
═════░▓█████████████▓███████▓███
═════════▒▓█████████░░█████████▒
════════════▒███████░═▒████████░
══════════════▓█████▒══░▓██████░
═══════════════▒█████░═══▒█████▓
════════════════▒█████══████████
═════════════════▓███▓═══▓███████▒▒▓█
══════════════════████░█░══▓████████▓
══════════════════██████░═══▒██████▓
═════════════█░═══██████══████████▒
═════════════▒█████████▓═══▒▓████▒
═══════════════▓███████░═════███▓
═════════════════████████══▓███▒
════════════════════░▓██▒\`

Личный дракон ${interaction.member}`)
                    } else {
                        interaction.reply(
                            `\`░██════════▒██
███═════════░███▒
███░══════════░███
███▓═════█══════███▒
████▒═══░██══════███▓════█
█████▒════███═════███▓═══▒██
██████▒════▓██▒═══░███▒═══▒██
████████░═══▓███═══████════▒██
█████████▓░══████══▒███▒════███
████████████▒█████══████░═══▓███
██████████████████▒═█████═══████▒
███████████████████═▒████▓══████▒
█████████████▓█████══█████▒═████░
█████████████▒═█████═▓██████████░
░═░░▒▓███████▒══░███░═██████████░
═══░════▒▓████═█░═▒██═██████████▒
███████▓▒░▒███═▒█▓░═══███████████
═░▒▓████████▓██═████▓▓███████████░
══════▒████▓███▒═█████████████████
════════▒███████░═▒███████████████░
══════════███████▓═▒█████████▓████▒
═══════════▓██████▓░█████████═▓███
════════════████████████████══███▓
═════════════██████████████▒═▒███
═══════░░░░░▒██████████████▒═████
═════░▓█████████████▓███████▓███
═════════▒▓█████████░░█████████▒
════════════▒███████░═▒████████░
══════════════▓█████▒══░▓██████░
═══════════════▒█████░═══▒█████▓
════════════════▒█████══████████
═════════════════▓███▓═══▓███████▒▒▓█
══════════════════████░█░══▓████████▓
══════════════════██████░═══▒██████▓
═════════════█░═══██████══████████▒
═════════════▒█████████▓═══▒▓████▒
═══════════════▓███████░═════███▓
═════════════════████████══▓███▒
════════════════════░▓██▒\`

Личный дракон ${interaction.member} прилетел к ${interaction.options.getUser(`пользователь`)}`)
                    }
                }
            };
                break;

            case `ban`: {
                const role = `850079173149065277`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        const n1 = [`A`, `B`, `C`, `D`, `E`, `F`, `G`, `H`, `I`, `J`, `K`, `L`, `M`, `N`, `O`, `P`, `Q`, `R`, `S`, `T`, `U`, `V`, `W`, `X`, `Y`, `Z`, `0`, `1`, `2`, `3`, `4`, `5`, `6`, `7`, `8`, `9`]
                        let r1 = n1[Math.floor(Math.random() * n1.length)]
                        let r2 = n1[Math.floor(Math.random() * n1.length)]
                        let r3 = n1[Math.floor(Math.random() * n1.length)]
                        let r4 = n1[Math.floor(Math.random() * n1.length)]
                        let r5 = n1[Math.floor(Math.random() * n1.length)]
                        let r6 = n1[Math.floor(Math.random() * n1.length)]
                        let r7 = n1[Math.floor(Math.random() * n1.length)]
                        let r8 = n1[Math.floor(Math.random() * n1.length)]
                        let r9 = n1[Math.floor(Math.random() * n1.length)]
                        let r10 = n1[Math.floor(Math.random() * n1.length)]
                        let r11 = n1[Math.floor(Math.random() * n1.length)]
                        let r12 = n1[Math.floor(Math.random() * n1.length)]
                        let r13 = n1[Math.floor(Math.random() * n1.length)]
                        let r14 = n1[Math.floor(Math.random() * n1.length)]
                        interaction.reply(
                            `◾◾◾
Failed to connect to the server


${interaction.member} is permanently banned from this server!

Reason: WATCHDOG CHEAT DETECTION (DC-${r1}${r2}${r3}${r4}${r5}${r6})
\`Find out more: https://www.hypixel.net/watchdog\` 

     Ban ID: #${r7}${r8}${r9}${r10}${r11}${r12}${r13}${r14}

◾◾◾`)
                    } else {
                        const n1 = [`A`, `B`, `C`, `D`, `E`, `F`, `G`, `H`, `I`, `J`, `K`, `L`, `M`, `N`, `O`, `P`, `Q`, `R`, `S`, `T`, `U`, `V`, `W`, `X`, `Y`, `Z`, `0`, `1`, `2`, `3`, `4`, `5`, `6`, `7`, `8`, `9`]
                        let r1 = n1[Math.floor(Math.random() * n1.length)]
                        let r2 = n1[Math.floor(Math.random() * n1.length)]
                        let r3 = n1[Math.floor(Math.random() * n1.length)]
                        let r4 = n1[Math.floor(Math.random() * n1.length)]
                        let r5 = n1[Math.floor(Math.random() * n1.length)]
                        let r6 = n1[Math.floor(Math.random() * n1.length)]
                        let r7 = n1[Math.floor(Math.random() * n1.length)]
                        let r8 = n1[Math.floor(Math.random() * n1.length)]
                        let r9 = n1[Math.floor(Math.random() * n1.length)]
                        let r10 = n1[Math.floor(Math.random() * n1.length)]
                        let r11 = n1[Math.floor(Math.random() * n1.length)]
                        let r12 = n1[Math.floor(Math.random() * n1.length)]
                        let r13 = n1[Math.floor(Math.random() * n1.length)]
                        let r14 = n1[Math.floor(Math.random() * n1.length)]
                        interaction.reply(
                            `◾◾◾
Failed to connect to the server


${interaction.options.getUser(`пользователь`)} is permanently banned from this server!

Reason: WATCHDOG CHEAT DETECTION (DC-${r1}${r2}${r3}${r4}${r5}${r6})
\`Find out more: https://www.hypixel.net/watchdog\` 

     Ban ID: #${r7}${r8}${r9}${r10}${r11}${r12}${r13}${r14}

◾◾◾`)
                    }
                }
            };
                break;
            case `santa`: {
                const role = `1046475276080648302`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`══════════(█)═════════════██████ 
═════════(███)═════════ █████████
════════(█████)═══════████████████
══════ (███████)══════ (░░░░░░░░░░░)
═════(█████████)═════(░░░░█░░█░░░░)
════(██░░░░░░░██)═══ (░░(░░░●░░░)░░░)
═════▒░░█░░█░░▒════ (░░░(░░◡░░)░░░░)
════▒░░░░░░░░░░▒═══ (░░░░░░░░░░░░░)
════▒░░█░░░█░░░▒═══██(░░░░░░░░░)██
════▒░░░███░░░░▒═══███(░░░░░░)████
═════▒░░░░░░░░▒═══████████████████
═════██░░░░░░██═══████████████████
════▒▒███████▒▒═══███ █████████ ███
══▒▒░░░█████░░░▒══███ █████████ ███
═▒░▒░░░███░░░▒░▒══███ █████████ ███
═▒░░▒░░███░░▒░░▒═ ███ █████████ ███
═▒░░░▒░███░▒░░░▒═ (░░) █████████═(░░)
══▒░░▒░███░▒░░▒══════█████████══(██)
═▒▒▒▒░░███░░▒▒▒▒═════█████████══/▓▓▓\
═▒░░░░░░░░░░░░░▒════ ████══████▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒═══████══████▓▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒═══████══████▓▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒══(░░░░)═(░░░░)▓▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒═══████══████▓▓▓▓▓▓▓▓)
═▒░░░░░░░░░░░░░▒════ ████══████▓▓▓▓▓▓▓)
══▒▒▒▒▒▒▒▒▒▒▒▒▒══════████══████▓▓▓▓▓▓)\`

${interaction.member} поздравляет с Новым годом всех участников гильдии!`)
                    } else {
                        interaction.reply(
                            `\`══════════(█)═════════════██████ 
═════════(███)═════════ █████████
════════(█████)═══════████████████
══════ (███████)══════ (░░░░░░░░░░░)
═════(█████████)═════(░░░░█░░█░░░░)
════(██░░░░░░░██)═══ (░░(░░░●░░░)░░░)
═════▒░░█░░█░░▒════ (░░░(░░◡░░)░░░░)
════▒░░░░░░░░░░▒═══ (░░░░░░░░░░░░░)
════▒░░█░░░█░░░▒═══██(░░░░░░░░░)██
════▒░░░███░░░░▒═══███(░░░░░░)████
═════▒░░░░░░░░▒═══████████████████
═════██░░░░░░██═══████████████████
════▒▒███████▒▒═══███ █████████ ███
══▒▒░░░█████░░░▒══███ █████████ ███
═▒░▒░░░███░░░▒░▒══███ █████████ ███
═▒░░▒░░███░░▒░░▒═ ███ █████████ ███
═▒░░░▒░███░▒░░░▒═ (░░) █████████═(░░)
══▒░░▒░███░▒░░▒══════█████████══(██)
═▒▒▒▒░░███░░▒▒▒▒═════█████████══/▓▓▓\
═▒░░░░░░░░░░░░░▒════ ████══████▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒═══████══████▓▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒═══████══████▓▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒══(░░░░)═(░░░░)▓▓▓▓▓▓▓)
▒░░░░░░░░░░░░░░░▒═══████══████▓▓▓▓▓▓▓▓)
═▒░░░░░░░░░░░░░▒════ ████══████▓▓▓▓▓▓▓)
══▒▒▒▒▒▒▒▒▒▒▒▒▒══════████══████▓▓▓▓▓▓)\`

${interaction.member} поздравляет с Новым годом пользователя ${interaction.options.getUser(`пользователь`)}!`)
                    }
                }
            };
                break;
            default: {
                await interaction.reply({
                    content: `Данной опции не существует! Выберите одну из предложенных!`,
                    ephemeral: true
                })
            }
                break;
            case `egg`: {
                const role = `1088824017517031544`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        interaction.reply(
                            `\`░░░░░░░░░░▄▄██████▄▄░░░░░░░░░░
░░░░░░░░▄███▀▀▀▀▀▀███▄░░░░░░░░
░░░░░░▄███▀░░░░░░░░▀███▄░░░░░░
░░░░░▄██▀░░░░░░░░░░░░▀██▄░░░░░
░░░░███▀░░░░░░░░░░░░░░▀███░░░░
░░░███░░░░░░░░░░░░░░░░░░███░░░
░░▄███░░░░░▄▄█▄░░░░░▄▄█▄███▄░░
░░██████▄████████▄████▀█████░░
░███░░▀▀█▀▀░░░░▀▀██▀░░░░▀▀███░
░███░░░░░░░▄█▄░░░░░░▄█▄░░░▀██░
███▀░░▄█▄░░▀▀░░░▄█▄░░▀▀░░▄████
███░░░░▀▀░░░░░░░▀▀░░░░░░░▀▀███
████▄▄░░░▄▄███▄▄░░░▄▄███▄▄░███
███▀███████▀▀▀███████▀▀▀██████
░██▄░░▀▀▀░░░░░░░▀▀▀░░░░░░░███░
░▀██▄░░░░░░░░░░░░░░░░░░░░▄██▀░
░░▀██▄░░░░░░░░░░░░░░░░░░▄██▀░░
░░░▀███▄▄░░░░░░░░░░░░▄▄███▀░░░
░░░░░▀▀████▄▄▄▄▄▄▄▄████▀▀░░░░░
░░░░░░░░░▀▀▀██████▀▀░░░░░░░░░░\`

${interaction.member} поздравляет с Пасхой всех участников гильдии!`)
                    } else {
                        interaction.reply(
                            `\`░░░░░░░░░░▄▄██████▄▄░░░░░░░░░░
░░░░░░░░▄███▀▀▀▀▀▀███▄░░░░░░░░
░░░░░░▄███▀░░░░░░░░▀███▄░░░░░░
░░░░░▄██▀░░░░░░░░░░░░▀██▄░░░░░
░░░░███▀░░░░░░░░░░░░░░▀███░░░░
░░░███░░░░░░░░░░░░░░░░░░███░░░
░░▄███░░░░░▄▄█▄░░░░░▄▄█▄███▄░░
░░██████▄████████▄████▀█████░░
░███░░▀▀█▀▀░░░░▀▀██▀░░░░▀▀███░
░███░░░░░░░▄█▄░░░░░░▄█▄░░░▀██░
███▀░░▄█▄░░▀▀░░░▄█▄░░▀▀░░▄████
███░░░░▀▀░░░░░░░▀▀░░░░░░░▀▀███
████▄▄░░░▄▄███▄▄░░░▄▄███▄▄░███
███▀███████▀▀▀███████▀▀▀██████
░██▄░░▀▀▀░░░░░░░▀▀▀░░░░░░░███░
░▀██▄░░░░░░░░░░░░░░░░░░░░▄██▀░
░░▀██▄░░░░░░░░░░░░░░░░░░▄██▀░░
░░░▀███▄▄░░░░░░░░░░░░▄▄███▀░░░
░░░░░▀▀████▄▄▄▄▄▄▄▄████▀▀░░░░░
░░░░░░░░░▀▀▀██████▀▀░░░░░░░░░░\`

${interaction.member} поздравляет с Пасхой пользователя ${interaction.options.getUser(`пользователь`)}!`)
                    }
                }
            };
                break;
            case `palm`: {
                const role = `1088824078342832240`;
                if (!interaction.member.roles.cache.has(role)) {
                    const embed = new EmbedBuilder()
                        .setAuthor({
                            name: `❗ Отсутствует необходимая роль!`
                        })
                        .setDescription(`У вас нет картинки \`${interaction.guild.roles.cache.get(role).name}\`!`)
                        .setThumbnail(`https://i.imgur.com/6IE3lz7.png`)
                        .setColor(`DarkRed`)
                        .setTimestamp(Date.now())

                    await interaction.reply({
                        embeds: [embed],
                        ephemeral: true
                    })

                } else {
                    if (!interaction.options.getUser(`пользователь`)) {
                        await interaction.reply(
                            `\`░░░░░░░░░░░░▀▀▀██▀▀▀▄▄░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░░▀▀▄░░░▀▄░░▄▄▄▀▀▀▄▄░░░░░
░░░░░░░░░▄▄▀▀▀▀▀▀▄██▄░░░█▀▀░░░░▄▄▄██▄░░
░░░░░░▄█▀░▄▄▄▄▄▄▄░░░░░░░░░░▄███▄░░░▀▀▄░
░░░░░▄██▀▀░░░▄▄▀▀░░▄▄▄▄░░░░░░░░░▀▀▀▄▄░░
░░░░░▀░░░░░▄▀░░░▄▄▄█░░█▀▀▀▄░░░▄▄▄▄░░▀█░
░░░░░░░░░▄▀░▄▄▀▀░░░█▄▄█▄░▄█░░░▀▀█░▀▀▀▄█
░░░░░░░░▄▀▄█▀░░░░░▄▀░░█▀▀▀░▀▄▄░░░█░░░▀█
░░░░░░░▄██▀░░░░░░▄█▄▄▄█░░░░░░▀█▄░░█░░░░
░░░░░░░▀▀░░░░░░░░█░░░█░░░░░░░░░░▀▄█░░░░
░░░░░░░░░░░░░░░░██▄▄██░░░░░░░░░░░▀█░░░░
░░░░░░░░░░░░░░░░█░░░▄▀░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░▄█▄▄▄█░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░█░░░░█░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░█░░░░▄█░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░▄▄█▀▀▀▀▀█▄▄░░░░░░░░░░░░░░░
░░░░░▄▄▄▀▀▀▀▀░░█░░░░░░█▀▀▀▀▀▀▄▄▄░░░░░░░
░▄▄▀▀░░░░░░░░░░░▀▀▀▀▀▀░░░░░░░░░░▀▀▄▄░░░
█▀░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▀█░░\`

${interaction.member} желает счастливых летних каникул всем участникам гильдии!`)
                    } else {
                        await interaction.reply(
                            `\`░░░░░░░░░░░░▀▀▀██▀▀▀▄▄░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░░▀▀▄░░░▀▄░░▄▄▄▀▀▀▄▄░░░░░
░░░░░░░░░▄▄▀▀▀▀▀▀▄██▄░░░█▀▀░░░░▄▄▄██▄░░
░░░░░░▄█▀░▄▄▄▄▄▄▄░░░░░░░░░░▄███▄░░░▀▀▄░
░░░░░▄██▀▀░░░▄▄▀▀░░▄▄▄▄░░░░░░░░░▀▀▀▄▄░░
░░░░░▀░░░░░▄▀░░░▄▄▄█░░█▀▀▀▄░░░▄▄▄▄░░▀█░
░░░░░░░░░▄▀░▄▄▀▀░░░█▄▄█▄░▄█░░░▀▀█░▀▀▀▄█
░░░░░░░░▄▀▄█▀░░░░░▄▀░░█▀▀▀░▀▄▄░░░█░░░▀█
░░░░░░░▄██▀░░░░░░▄█▄▄▄█░░░░░░▀█▄░░█░░░░
░░░░░░░▀▀░░░░░░░░█░░░█░░░░░░░░░░▀▄█░░░░
░░░░░░░░░░░░░░░░██▄▄██░░░░░░░░░░░▀█░░░░
░░░░░░░░░░░░░░░░█░░░▄▀░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░▄█▄▄▄█░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░█░░░░█░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░█░░░░▄█░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░▄▄█▀▀▀▀▀█▄▄░░░░░░░░░░░░░░░
░░░░░▄▄▄▀▀▀▀▀░░█░░░░░░█▀▀▀▀▀▀▄▄▄░░░░░░░
░▄▄▀▀░░░░░░░░░░░▀▀▀▀▀▀░░░░░░░░░░▀▀▄▄░░░
█▀░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▀█░░\`

${interaction.member} желает счастливых летних каникул пользователю ${interaction.options.getUser(`пользователь`)}!`)
                    }
                }
            };
                break;

        }
    } catch (e) {
        const admin = await client.users.fetch(`491343958660874242`)
        console.log(e)
        let options = interaction?.options.data.map(a => {
            return `{
"status": true,
"name": "${a.name}",
"type": ${a.type},
"autocomplete": ${a?.autocomplete ? true : false},
"value": "${a?.value ? a.value : "No value"}",
"user": "${a?.user?.id ? a.user.id : "No User"}",
"channel": "${a?.channel?.id ? a.channel.id : "No Channel"}",
"role": "${a?.role?.id ? a.role.id : "No Role"}",
"attachment": "${a?.attachment?.url ? a.attachment.url : "No Attachment"}"
}`
        })
        await admin.send(`Произошла ошибка!`)
        await admin.send(`=> ${e}.
**Команда**: \`${interaction.commandName}\`
**Пользователь**: ${interaction.member}
**Канал**: ${interaction.channel}
**Опции**: \`\`\`json
${interaction.options.data.length <= 0 ? `{"status": false}` : options.join(`,\n`)}
\`\`\``)
        await admin.send(`◾`)
    }

}
module.exports = {
    category: `em`,
    plugin: {
        id: "items",
        name: "Предметы"
    },
    data: new SlashCommandBuilder()
        .setName(`picture`)
        .setDescription(`Отправить картинку в чат`)
        .setDMPermission(false)
        .addStringOption(option => option
            .setName(`картинка`)
            .setDescription(`Выберите картинку, которую хотите отправить в чат`)
            .setAutocomplete(true)
            .setRequired(true)
        )
        .addUserOption(option => option
            .setName(`пользователь`)
            .setDescription(`Выберите пользователя, к кому хотите применить картинку`)
            .setRequired(false)
        ),
    autoComplete,
    execute
}